#Задача №1
a = []

for k in range(0, 10):
    a.append(int(input()))

for i in range(len(a)):
    for j in range(0, len(a) - i - 1):
        if a[j] > a[j + 1]:
            step = a[j]
            a[j] = a[j+1]
            a[j+1] = step
    print(a)
#-----------------------------------------------------

#Задача №2
M = {'ноль': 0,'Ноль': 0, 'один': 1, 'Один': 1, 'два': 2, 'Два': 2, 'три': 3, 'Три': 3, 'четыре': 4, 'Четыре': 4, 'пять': 5, 'Пять': 5, 'шесть': 6, 'Шесть': 6, 'семь': 7, 'Семь': 7, 'восемь': 8, 'Восемь': 8, 'девять': 9, 'Девять': 9,
                   'десять': 10, 'Десять': 10, 'одиннадцать': 11, 'Одиннадцать': 11, 'двенадцать': 12, 'Двенадцать': 12, 'тринадцать': 13, 'Тринадцать': 13, 'четырнадцать': 14, 'Четырнадцать': 14, 'пятнадцать': 15, 'Пятнадцать': 15, 'шестнадцать': 16, 'Шестнадцать': 16, 'семнадцать': 17, 'Семнадцать': 17, 'восемнадцать': 18, 'Восемнадцать': 18, 'девятнадцать': 19, 'Девятнадцать': 19,
                   'двадцать': 20, 'Двадцать': 20, 'тридцать': 30, 'Тридцать': 30, 'сорок': 40, 'Сорок': 40, 'пятьдесят': 50, 'Пятьдесят': 50, 'шестьдесят': 60, 'Шестьдесят': 60, 'семьдесят': 70, 'Семьдесят': 70, 'восемьдесят': 80, 'Восемьдесят': 80, 'девяносто': 90, 'Девяносто': 90, 'сто': 100, 'Сто': 100}

n = str(input())

x = 0
a = n.split()
for i in range(len(a)):
    y = M[a[i]]
    x = x + y
print(x)
#-----------------------------------------------------

#Задача №3 (+-)
a = {
    'Лопахин': {
        'Должность': 'купец',
        'Возраст': 35,
        'Пол': 'Мужской'
    },
    'Фирс': {
        'Должность': 'лакей',
        'Возраст': None,
        'Пол': 'Мужской'
    },
    'Трофимов': {
        'Должность': 'дворянин',
        'Возраст': 47,
        'Пол': 'Мужской'
    },
    'Яша': {
        'Должность': 'лакей',
        'Возраст': 28,
        'Пол': 'Мужской'
    },
    'Варя': {
        'Должность': 'воспитанница',
        'Возраст': 24,
        'Пол': 'Женский'
    },
    'Аня': {
        'Должность': 'дочь',
        'Возраст': 17,
        'Пол': 'Женский'
    },
    'Дуняшка': {
        'Должность': 'горничная',
        'Возраст': None,
        'Пол': 'Женский'
    },
    'Шарлотта': {
        'Должность': 'гувернантка',
        'Возраст': 40,
        'Пол': 'Женский'
    },
    'Раневская': {
        'Должность': 'дворянка',
        'Возраст': 32,
        'Пол': 'Женский'
    },
}

def m(x):
    return sum(x) / len(x)

q = []
z = []
for h, c in a.items():
    if c.get("Возраст") != None and c.get("Пол") == "Мужской":
        q.append(c.get('Возраст'))
    elif c.get("Возраст") != None and c.get("Пол") == "Женский":
        z.append(c.get('Возраст'))

zl = m(z)
ql = m(q)
for h, c in a.items():
    if c.get("Возраст") == None and c.get("Пол") == "Мужской":
        c.update({'Возраст': ql})
    elif c.get("Возраст") == None and c.get("Пол") == "Женский":
        c.update({'Возраст': zl})

print(a)
for h, c in a.items():
    if c.get("Возраст") > 30 and c.get("Пол") == "Мужской":
        print("%s %d %s" % (h, c.get('Возраст'), c.get('Должность')))

for h, c in a.items():
    if c.get("Возраст") < 24 and c.get("Пол") == "Женский":
        print("%s %d %s" % (h, c.get('Возраст'), c.get('Должность')))
#-----------------------------------------------------

# Задача №4
def poisk(n, l, m, b, t, k):
    while True:
        a = b
        for i in range(n):
            if not k[i] and t[i] < a:
                a = t[i]
                q = i

        if a == b:
            break

        i = q
        k[i] = True

        for j in range(n):
            if t[i] + m[i][j] < t[j] and m[i][j] > 0:
                t[j] = t[i] + m[i][j]

    if t[l - 1] == b:
        print(None)
    else:
        print(t[l - 1])


n, h, z = map(int, input().split())
m = []
for i in range(n):
    m.append(list(map(int, input().split())))

p = 1000
t = [p] * n
t[h - 1] = 0
s = [False] * n
global q
poisk(n, z, m, p, t, s)
